setAnalysisMode -analysisType single -asyncChecks async -checkType setup -clkSrcPath false -clockPropagation forcedIdeal -skew true -virtualIPO false
setExtractRCMode  -engine preRoute
setDelayCalMode -engine default
setPlaceMode -ignoreScan true -timingDriven true
setIlmMode -highFanoutPort true -loopBack false 
setImportMode -config true -keepEmptyModule true -treatUndefinedCellAsBbox false
