###############################################################
#  Generated by:      Cadence Encounter 09.11-s084_1
#  OS:                Linux x86_64(Host ID lib-33034.eos.ncsu.edu)
#  Generated on:      Mon May  5 19:50:49 2014
#  Command:           saveDesign ./cortex_soc_cts.enc
###############################################################
set sdc_version 1.4
current_design cortex_soc
create_clock [get_ports {HCLK}]  -name clock -period 4.7 -waveform {0 2.35}
set_propagated_clock  [get_ports {HCLK}]
